public class Main {
    public static void main(String[] args) {
        // q1
        // Перевести число 333 из шестнадцатиричной в десятичную.
        //333= 3*16^0+3*16^1+3*16^2= 3+48+768=819

        // q2
        //Разложить число 200345 на разряды в десятичной системе.
        // 200345 = (5 * 10^0) + (4*10^1)+(3*10^2)+(0*10^3)+(0*10^4)+(2*10^5)=5+40+300+0+0+200000=200345

        //q3 еревести 637 из десятичной в шестнадцатиричную и обратно (10->16 и 16->10).
        // 637 = 637/16
        //целое = 637/16=39
        //остаток= 637%16=13

        // целая = 39/16 =2
        //остаток = 39%16 = 7

        //цедпя 2/16=0
        //остаток = 2%16 =2

        // шестнадцатиричная = 27D

        //27D = 13*16^0+7*16^1+2*16^2 = 13+112+512=637(десятиричная)

        //q4 Перевести 637 из десятичной в двоичную.
        //целое = 637/2 = 318
        //остаток 637%2=1

       // 318/2=159
        // 318%2=0

        //159/2=79
        //159%2=1

        //79/2=39
        //79%2=1

        //39/2=19
        //39%2=1

        //19/2=9
        //19%2=1

        //9/2=4
        //9%2=1

        //4/2=2
        //4%2=0

        //2/2=1
        //2%2=0

        //1/2=0
        //1%2=1

        //двоичная = 1001111101


        //q5 11100111 перевести в десятичную
        //=1*2^0+1*2^1+1*2^2+0*2^3+0*2^4+1*2^5+1*2^6+1*2^7=1+2+4+0+0+32+64+128=231

        //q6 Перевести 637 из десятичной в троичную

        //637/3=212
        //637%3=1

        //212/3=70
        //212%3=2

        //70/3=23
        //70%3=1

        //23/3=7
        //23%3=2

        //7/3=2
        //7%3=1

        //2/3=0
        //2%3=2

        //троичная = 212121

//задания со *



        







    }
}
